InformationRegisters/СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОбменаДаннымиССервисомПрогнозированияПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбменДаннымиАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружаемаяСейчасКоллекция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КоллекцииСервисаПрогнозированияПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланированоВыгрузитьОбъектовКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженоОбъектовКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланированоВыгрузитьКоллекций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженоКоллекций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыОбменаДаннымиССервисомПрогнозированияПродаж/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить статусы обмена данными.
// 
// Возвращаемое значение:
//  Структура - Получить статусы обмена данными:
//   * ОбменДаннымиАктивен - Булево -
//   * ТипОбмена - Число -
//   * ПоРасписанию - Булево -
//   * ВыгружаемаяСейчасКоллекция - ПеречислениеСсылка.КоллекцииСервисаПрогнозированияПродаж -
//   * ЗапланированоВыгрузитьОбъектовКоллекции - Число -
//   * ВыгруженоОбъектовКоллекции - Число -
//   * ДатаЗавершения - Дата -
//   * ДатаОбновленияЗаписи - Дата -
//   * ЕстьОшибка - Булево -
//   * ТекстОшибки - Строка -
Функция ПолучитьСтатусыОбменаДанными() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ОбменДаннымиАктивен,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ТипОбмена,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ПоРасписанию,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ВыгружаемаяСейчасКоллекция,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ЗапланированоВыгрузитьОбъектовКоллекции,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ЗапланированоВыгрузитьКоллекций,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ВыгруженоОбъектовКоллекции,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ВыгруженоКоллекций,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ДатаЗавершения,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ДатаОбновленияЗаписи,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ЕстьОшибка,
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ТекстОшибки
	|ИЗ
	|	РегистрСведений.СтатусыОбменаДаннымиССервисомПрогнозированияПродаж КАК
	|		СтатусыОбменаДаннымиССервисомПрогнозированияПродаж
	|ГДЕ
	|	СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ИдентификаторЗаписи = &ИдентификаторЗаписи";
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", "1");
	
	Ответ = ШаблонЗаполненияПолейКоллекций();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Записать статусы обмена данными.
// 
// Параметры:
//  ЗначенияПолейКоллекции - см. ШаблонЗаполненияПолейКоллекций
// 
Процедура ЗаписатьСтатусыОбменаДанными(ЗначенияПолейКоллекции) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СтатусыОбменаДаннымиССервисомПрогнозированияПродаж");
		ЭлементБлокировкиДанных.УстановитьЗначение("ИдентификаторЗаписи", "1");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
	
		НаборЗаписей = РегистрыСведений.СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить("1");
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ЗначенияПолейКоллекции);
		Запись.ИдентификаторЗаписи = "1";
		Запись.ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СобытиеЖурналаРегистрации = СервисПрогнозированияПереопределяемый.ТекстСобытиеЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СтатусыОбменаДаннымиССервисомПрогнозированияПродаж,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Шаблон заполнения полей коллекций.
// 
// Возвращаемое значение:
//  Структура - Шаблон заполнения полей коллекций:
//   * ОбменДаннымиАктивен - Булево -
//   * ТипОбмена - Число - 0 - выгрузка, 1 - загрузка.
//   * ПоРасписанию - Булево -
//   * ВыгружаемаяСейчасКоллекция - ПеречислениеСсылка.КоллекцииСервисаПрогнозированияПродаж -
//   * ЗапланированоВыгрузитьОбъектовКоллекции - Число -
//   * ВыгруженоОбъектовКоллекции - Число - 
//   * ДатаЗавершения - Дата -
//   * ЕстьОшибка - Булево -
//   * ТекстОшибки - Строка -
Функция ШаблонЗаполненияПолейКоллекций() Экспорт
	
	Ответ = Новый Структура();
	Ответ.Вставить("ОбменДаннымиАктивен", Ложь);
	Ответ.Вставить("ТипОбмена", 0); // 0 - выгрузка, 1 - загрузка.
	Ответ.Вставить("ПоРасписанию", Ложь);
	Ответ.Вставить("ВыгружаемаяСейчасКоллекция", Перечисления.КоллекцииСервисаПрогнозированияПродаж.ПустаяСсылка());
	Ответ.Вставить("ЗапланированоВыгрузитьОбъектовКоллекции", 0);
	Ответ.Вставить("ВыгруженоОбъектовКоллекции", 0);
	Ответ.Вставить("ЗапланированоВыгрузитьКоллекций", 0);
	Ответ.Вставить("ВыгруженоКоллекций", 0);
	Ответ.Вставить("ДатаЗавершения", Дата(1,1,1));
	Ответ.Вставить("ДатаОбновленияЗаписи", Дата(1, 1, 1));
	Ответ.Вставить("ЕстьОшибка", Ложь);
	Ответ.Вставить("ТекстОшибки", "");
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
